===
Int
===

42;

---

(source_file
  (statement
    (int)))

===========
Hexidecimal
===========

0xaf30;

---

(source_file
  (statement
    (hexidecimal)))

=====
Float
=====

1.323;

---

(source_file
  (statement
    (float)))

===
Dur
===

5.5::second;

---

(source_file
  (statement
    (dur
      (float)
      (duration_identifier))))
