===========
Declaration
===========

// declare an 'int' called 'foo'
int foo;

---

(source_file
  (comment)
  (statement
    (variable_declaration
      (primitive_type)
      (variable_identifier))))

==========
Assignment
==========

// assign value of 2 to 'foo'
2 => foo;

---

(source_file
  (comment)
  (statement
    (chuck_operation
      (int)
      (chuck_operator)
      (member_identifier
        (variable_identifier)))))

==============
Initialization
==============

// assign 2 to a new variable 'foo' of type 'int'
2 => int foo;

---

(source_file
  (comment)
  (statement
    (chuck_operation
      (int)
      (chuck_operator)
      (variable_declaration
        (primitive_type)
        (variable_identifier)))))

===========
Debug print
===========

// debug-print the value of foo
<<< foo >>>;

---

(source_file
  (comment)
  (statement
    (debug_print
      (member_identifier
        (variable_identifier)))))

======
Update
======

// multiply 'foo' by 10, assign back to 'foo'
foo * 10 => foo;

---

(source_file
  (comment)
  (statement
    (chuck_operation
      (binary_expression
        (member_identifier
          (variable_identifier))
        (operator)
        (int))
      (chuck_operator)
      (member_identifier
        (variable_identifier)))))

==========
Mult-chuck
==========

// multiply 'foo' by 10, and then assign to 'foo'
10 *=> foo;

---

(source_file
  (comment)
  (statement
    (chuck_operation
      (int)
      (chuck_operator)
      (member_identifier
        (variable_identifier)))))

=========
Operation
=========

// assign value of '5 seconds' to new variable bar
5::second => dur bar;

// 4 bar, a measure?
4::bar => dur measure;

---

(source_file
  (comment)
  (statement
    (chuck_operation
      (dur
        (int)
        (duration_identifier))
      (chuck_operator)
      (variable_declaration
        (primitive_type)
        (variable_identifier))))
  (comment)
  (statement
    (chuck_operation
      (dur
        (int)
        (variable_identifier))
      (chuck_operator)
      (variable_declaration
        (primitive_type)
        (variable_identifier)))))
