========
Division
========

// divide (and assign)
16 / 4 => int four;

---

(source_file
  (comment)
  (chuck_operation
    (binary_expression
      (int)
      (operator)
      (int))
    (variable_declaration
      (primitive_type)
      (variable_identifier))))

==============
Multiplication
==============

// multiply
2 * 2 => four;

---

(source_file
  (comment)
  (chuck_operation
    (binary_expression
      (int)
      (operator)
      (int))
    (variable_identifier)))

========
Addition
========

// add
3 + 1 => four;

---

(source_file
  (comment)
  (chuck_operation
    (binary_expression
      (int)
      (operator)
      (int))
    (variable_identifier)))

===========
Subtraction
===========

// subtract
93 - 89 => four;

---

(source_file
  (comment)
  (chuck_operation
    (binary_expression
      (int)
      (operator)
      (int))
    (variable_identifier)))

===========
Casting
===========

// adding float and int produces a float
9.1 + 2 => float result;

// however, going from float to int requires cast
4.8 $ int => int foo;  // foo == 4

// this function expects two floats
Math.rand2f( 30.0, 1000.0 );

// this is ok because of implicit cast
Math.rand2f( 30, 1000 );

---

(source_file
  (comment)
  (chuck_operation
    (binary_expression
      (float)
      (operator)
      (int))
    (variable_declaration
      (primitive_type)
      (variable_identifier)))
  (comment)
  (chuck_operation
    (cast
      (float)
      (primitive_type))
    (variable_declaration
      (primitive_type)
      (variable_identifier)))
  (comment)
  (comment)
  (function_call
    (member_identifier
      (class_identifier)
      (variable_identifier))
    (float)
    (float))
  (comment)
  (function_call
    (member_identifier
      (class_identifier)
      (variable_identifier))
    (int)
    (int)))
