===========
Right shift
===========

8 >> 1;

---

(source_file
  (statement
    (binary_expression
      (int)
      (operator)
      (int))))

==========
Left shift
==========

8 << 1;

---

(source_file
  (statement
    (binary_expression
      (int)
      (operator)
      (int))))

===========
Bitwise AND
===========

8 & 1;

---

(source_file
  (statement
    (binary_expression
      (int)
      (operator)
      (int))))

==========
Bitwise OR
==========

8 | 1;

---

(source_file
  (statement
    (binary_expression
      (int)
      (operator)
      (int))))

===========
Bitwise XOR
===========

8 ^ 1;

---

(source_file
  (statement
    (binary_expression
      (int)
      (operator)
      (int))))
